{
    "experiences": [
        {
            "title": "Data Structures and Algorithms Teaching Assistant",
            "company": "College of Engineering - University of Michigan",
            "mainPoint": "This is where I fell in love with teaching :)",
            "description": "I had the privilege of supporting 950+ students by instructing weekly 2 hour labs of 30+ undergraduates, providing 1-on-1 office hours, and authoring concise exam questions. Collaborating with students was a blast!",
            "dates": "January 2022 - January 2025",
            "skills": ["C++", "Collaborative Problem Solving", "Public Speaking"]
        },
        {
            "title": "Full Stack Developer",
            "company": "Michigan Public Health Integrated Center for Outbreak Analytics and Modeling (MICOM)",
            "mainPoint": "Here, I realized my passion for \"tech for good\"",
            "description": "In this role, I pair programmed, implemented, and peer reviewed key full stack features on an incredible project that graphically tracks state vaccination records. This $17.5 million project helps epidemiologists to analyze trends and better allocate resources to underprivileged areas.",
            "imgUrl": "/portfolio/experience_img/lighthouse.png",
            "dates": "Summer 2024",
            "skills": ["React.js", "Python", "Pair Programming"]
        },
        {
            "title": "Full Stack Developer",
            "company": "Information and Technology Services - University of Michigan",
            "mainPoint": "This is where I discovered the excitement of full-stack development!",
            "description": "I independently designed and implemented a user-friendly full stack web application that enables network engineers to create and provision customized tests to Raspberry Pi computers. This facilitates wireless WiFi testing at the click of a button - pretty neat, huh?",
            "imgUrl": "/portfolio/experience_img/its_poster.png",
            "dates": "Summer 2023",
            "skills": ["Vue.js", "Node.js", "MongoDB", "UX Design"]
        },
        {
            "title": "Software Engineer Intern",
            "company": "Dynamic Map Platform North America (formerly Ushr)",
            "mainPoint": "Here, I built confidence and reaffirmed my love for CS and math.",
            "description": "I explored the landscape of semi-autonomous vehicles via data analysis and test-driven development. Notably, I authored an interactive dashboard complete with descriptive datasets and plots, along with automated test cases to support development of a data extraction application.",
            "dates": "Summers 2021, 2022",
            "skills": ["Python", "SQL", "Test Driven Development"]
        }
    ]
}